posts/test.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Themes again other tesxt</title>
<meta name="generator" content="Org Mode" />
<!-- <link rel="stylesheet" type="text/css" href="/ox.css"/> -->
<link rel="stylesheet" type="text/css" href="/custom.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=JetBrains+Mono" rel="stylesheet">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css">
<!-- copy org-blocks to clipboard  -->
</head>
<body>
<div id="preamble" class="status">
<hr style="border-top: 1px solid black;">
<div class='topnav' style='display: flex; justify-content: space-between; align-items: center;'>
  <h2 style='margin-top: 0; margin-bottom: 0; margin-left:0px;'>Javier Pacheco</h2> 
  <div>
    <a href='/index.html' style='font-weight:bold;'>Home</a> |
    <a href='/archive.html' style='font-weight:bold;'>Blog</a> | 
    <a href='/about.html' style='font-weight:bold;'>About Me</a> | 
  </div>
</div>
<hr style="border-top: 1px solid black;">
</div>
<div id="content" class="content">
<header>
<h1 class="title">Themes again other tesxt</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h:0f3ffdd6-6b21-4e10-a01b-ce72a618a1f5">Themes in emacs and end of the year.</a></li>
</ul>
</div>
</nav>
<p>

</p>
<div class="PREVIEW" id="orgcec00a0">
<p>
Some things are happening by a reason, so, instead of see the "bad" things that
happens; is a better practice to see the good side of the thing, these more or less
are some phrases that my dad says to me when me and my family have some problems.
</p>

</div>

<div id="outline-container-h:0f3ffdd6-6b21-4e10-a01b-ce72a618a1f5" class="outline-2">
<h2 id="h:0f3ffdd6-6b21-4e10-a01b-ce72a618a1f5">Themes in emacs and end of the year.</h2>
<div class="outline-text-2" id="text-h:0f3ffdd6-6b21-4e10-a01b-ce72a618a1f5">
<p>
I started to manage my themes, actually only one, I get rid off the <i>doom-themes</i>.
and add the atom-one-dark theme, lets see what will happens,
I actually like this theme the most, the only thing that is an issue from me
is the actual fonts management, so I'm going to "hack" this theme a little bit.
</p>

<p>
A end of another year is happening, this year  was a very though, health issues,
lack of money, lack of time, but at the end of the road, there is a minimal light
I hope that last call be the key, and hope this new year came with new challenges
and more opportunities.
</p>

<p>
This year I learn a lot of things, like:
</p>
<ul class="org-ul">
<li>Emacs.</li>
<li>nvim/vim.</li>
<li>voidlinux.</li>
<li>re-learn how to program a robot.</li>
</ul>
<p>
This ending year was a very good one, strong to get in trough but a very good one.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-05-28 Tue 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
